# Rendered by chezmoi to ~/.Brewfile — run with: brew bundle --global
# Shared (all machines) first, machine-specific sections at the bottom.

# Taps
tap "homebrew/services"

# Core tools
brew "git"
brew "chezmoi"
brew "zsh"
brew "tmux"
brew "neovim"

# Shell enhancements
brew "powerlevel10k"         # Zsh theme
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "fzf"
brew "fd"                    # Better find
brew "ripgrep"              # Better grep
brew "ripgrep-all"          # rg over PDFs, docs, archives (used by fif)
brew "bat"                  # Better cat
brew "eza"                  # Better ls
brew "zoxide"               # Better cd
brew "atuin"                # Better shell history

# Development tools
brew "nvm"                  # Node version manager (manages node itself)
brew "python"
brew "go"
brew "rust"
brew "docker"
brew "docker-compose"

# Infrastructure / ops
brew "ansible"
brew "awscli"
brew "bitwarden-cli"
brew "caddy"
brew "dnsmasq"
brew "terraform"

# Language servers and formatters (for Neovim)
brew "lua-language-server"
brew "stylua"
brew "typescript-language-server"
brew "prettier"
brew "eslint"
brew "black"
brew "ruff"
brew "pipx"  # Python application installer
brew "gopls"
brew "rust-analyzer"

# Utilities
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor
brew "gh"                   # GitHub CLI
brew "lazygit"             # Terminal UI for git
brew "lazydocker"          # Terminal UI for docker
brew "htop"                # Process viewer
brew "ncdu"                # Disk usage
brew "tldr"                # Simplified man pages
brew "tree"                # Directory listing
brew "wget"
brew "curl"
brew "gnupg"
brew "pass"                # Password manager

# Database clients
brew "postgresql@14"
brew "mysql-client"
brew "redis"

# macOS specific tools
brew "mas"                  # Mac App Store CLI
brew "trash"               # Move to trash instead of rm

# Casks (GUI applications)
cask "iterm2"
cask "kitty"
cask "linearmouse"
cask "visual-studio-code"
cask "codex"
cask "docker-desktop"
cask "zulu@8"               # JDK 8 (java-8 alias)
cask "spotify"
cask "bitwarden"
cask "firefox"
cask "google-chrome"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
{{- if eq .machine "personal" }}

# ============================================================================
# Personal machine only
# ============================================================================
cask "anki"
cask "db-browser-for-sqlite"
cask "discord"
cask "dropbox"
cask "figma"
cask "gimp"
cask "mactex-no-gui"
cask "notion"
cask "obs"
cask "zoom"
{{- end }}
